---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.GetKeys
source: html/78c1ea60-254d-0e8b-bd26-c099ea7129d7.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.GetKeys Method

Gets all the keys stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLinetypeKey> GetKeys()
```

## Returns
The keys.